AllenMaa/mm32f5330_canable/code/mm32f5330_canable_mdk/device/mm32f5333d_features.h
#define TIM_ADV_CCMR2_OC3CE_SHIFT                TIM1_CCMR2_OC3CE_SHIFT
#define TIM_ADV_CCMR2_OC3CE_MASK                 TIM1_CCMR2_OC3CE_MASK
#define TIM_ADV_CCMR2_OC3CE(x)                   TIM1_CCMR2_OC3CE(x)

#define TIM_ADV_CCMR2_OC3M_SHIFT                 TIM1_CCMR2_OC3M_SHIFT
#define TIM_ADV_CCMR2_OC3M_MASK                  TIM1_CCMR2_OC3M_MASK
#define TIM_ADV_CCMR2_OC3M(x)                    TIM1_CCMR2_OC3M(x)

#define TIM_ADV_CCMR2_OC3PE_SHIFT                TIM1_CCMR2_OC3PE_SHIFT
#define TIM_ADV_CCMR2_OC3PE_MASK                 TIM1_CCMR2_OC3PE_MASK
#define TIM_ADV_CCMR2_OC3PE(x)                   TIM1_CCMR2_OC3PE(x)

#define TIM_ADV_CCMR2_OC3FE_SHIFT                TIM1_CCMR2_OC3FE_SHIFT
#define TIM_ADV_CCMR2_OC3FE_MASK                 TIM1_CCMR2_OC3FE_MASK
#define TIM_ADV_CCMR2_OC3FE(x)                   TIM1_CCMR2_OC3FE(x)

#define TIM_ADV_CCMR2_CC3S_SHIFT                 TIM1_CCMR2_CC3S_SHIFT
#define TIM_ADV_CCMR2_CC3S_MASK                  TIM1_CCMR2_CC3S_MASK
#define TIM_ADV_CCMR2_CC3S(x)                    TIM1_CCMR2_CC3S(x)

/*!
 * @brief TIM_ADV_CCMR2 Register Bit Definition
 */

#define TIM_ADV_CCMR2_IC4F_SHIFT                 TIM1_CCMR2_IC4F_SHIFT
#define TIM_ADV_CCMR2_IC4F_MASK                  TIM1_CCMR2_IC4F_MASK
#define TIM_ADV_CCMR2_IC4F(x)                    TIM1_CCMR2_IC4F(x)

#define TIM_ADV_CCMR2_IC4PSC_SHIFT               TIM1_CCMR2_IC4PSC_SHIFT
#define TIM_ADV_CCMR2_IC4PSC_MASK                TIM1_CCMR2_IC4PSC_MASK
#define TIM_ADV_CCMR2_IC4PSC(x)                  TIM1_CCMR2_IC4PSC(x)

#define TIM_ADV_CCMR2_CC4S_SHIFT                 TIM1_CCMR2_CC4S_SHIFT
#define TIM_ADV_CCMR2_CC4S_MASK                  TIM1_CCMR2_CC4S_MASK
#define TIM_ADV_CCMR2_CC4S(x)                    TIM1_CCMR2_CC4S(x)

#define TIM_ADV_CCMR2_IC3F_SHIFT                 TIM1_CCMR2_IC3F_SHIFT
#define TIM_ADV_CCMR2_IC3F_MASK                  TIM1_CCMR2_IC3F_MASK
#define TIM_ADV_CCMR2_IC3F(x)                    TIM1_CCMR2_IC3F(x)

#define TIM_ADV_CCMR2_IC3PSC_SHIFT               TIM1_CCMR2_IC3PSC_SHIFT
#define TIM_ADV_CCMR2_IC3PSC_MASK                TIM1_CCMR2_IC3PSC_MASK
#define TIM_ADV_CCMR2_IC3PSC(x)                  TIM1_CCMR2_IC3PSC(x)

#define TIM_ADV_CCMR2_CC3S_SHIFT                 TIM1_CCMR2_CC3S_SHIFT
#define TIM_ADV_CCMR2_CC3S_MASK                  TIM1_CCMR2_CC3S_MASK
#define TIM_ADV_CCMR2_CC3S(x)                    TIM1_CCMR2_CC3S(x)

/*!
 * @brief TIM_ADV_CCER Register Bit Definition
 */

#define TIM_ADV_CCER_CC4NP_SHIFT                 TIM1_CCER_CC4NP_SHIFT
#define TIM_ADV_CCER_CC4NP_MASK                  TIM1_CCER_CC4NP_MASK
#define TIM_ADV_CCER_CC4NP(x)                    TIM1_CCER_CC4NP(x)

#define TIM_ADV_CCER_CC4NE_SHIFT                 TIM1_CCER_CC4NE_SHIFT
#define TIM_ADV_CCER_CC4NE_MASK                  TIM1_CCER_CC4NE_MASK
#define TIM_ADV_CCER_CC4NE(x)                    TIM1_CCER_CC4NE(x)

#define TIM_ADV_CCER_CC4P_SHIFT                  TIM1_CCER_CC4P_SHIFT
#define TIM_ADV_CCER_CC4P_MASK                   TIM1_CCER_CC4P_MASK
#define TIM_ADV_CCER_CC4P(x)                     TIM1_CCER_CC4P(x)

#define TIM_ADV_CCER_CC4E_SHIFT                  TIM1_CCER_CC4E_SHIFT
#define TIM_ADV_CCER_CC4E_MASK                   TIM1_CCER_CC4E_MASK
#define TIM_ADV_CCER_CC4E(x)                     TIM1_CCER_CC4E(x)

#define TIM_ADV_CCER_CC3NP_SHIFT                 TIM1_CCER_CC3NP_SHIFT
#define TIM_ADV_CCER_CC3NP_MASK                  TIM1_CCER_CC3NP_MASK
#define TIM_ADV_CCER_CC3NP(x)                    TIM1_CCER_CC3NP(x)

#define TIM_ADV_CCER_CC3NE_SHIFT                 TIM1_CCER_CC3NE_SHIFT
#define TIM_ADV_CCER_CC3NE_MASK                  TIM1_CCER_CC3NE_MASK
#define TIM_ADV_CCER_CC3NE(x)                    TIM1_CCER_CC3NE(x)

#define TIM_ADV_CCER_CC3P_SHIFT                  TIM1_CCER_CC3P_SHIFT
#define TIM_ADV_CCER_CC3P_MASK                   TIM1_CCER_CC3P_MASK
#define TIM_ADV_CCER_CC3P(x)                     TIM1_CCER_CC3P(x)

#define TIM_ADV_CCER_CC3E_SHIFT                  TIM1_CCER_CC3E_SHIFT
#define TIM_ADV_CCER_CC3E_MASK                   TIM1_CCER_CC3E_MASK
#define TIM_ADV_CCER_CC3E(x)                     TIM1_CCER_CC3E(x)

#define TIM_ADV_CCER_CC2NP_SHIFT                 TIM1_CCER_CC2NP_SHIFT
#define TIM_ADV_CCER_CC2NP_MASK                  TIM1_CCER_CC2NP_MASK
#define TIM_ADV_CCER_CC2NP(x)                    TIM1_CCER_CC2NP(x)

#define TIM_ADV_CCER_CC2NE_SHIFT                 TIM1_CCER_CC2NE_SHIFT
#define TIM_ADV_CCER_CC2NE_MASK                  TIM1_CCER_CC2NE_MASK
#define TIM_ADV_CCER_CC2NE(x)                    TIM1_CCER_CC2NE(x)

#define TIM_ADV_CCER_CC2P_SHIFT                  TIM1_CCER_CC2P_SHIFT
#define TIM_ADV_CCER_CC2P_MASK                   TIM1_CCER_CC2P_MASK
#define TIM_ADV_CCER_CC2P(x)                     TIM1_CCER_CC2P(x)

#define TIM_ADV_CCER_CC2E_SHIFT                  TIM1_CCER_CC2E_SHIFT
#define TIM_ADV_CCER_CC2E_MASK                   TIM1_CCER_CC2E_MASK
#define TIM_ADV_CCER_CC2E(x)                     TIM1_CCER_CC2E(x)

#define TIM_ADV_CCER_CC1NP_SHIFT                 TIM1_CCER_CC1NP_SHIFT
#define TIM_ADV_CCER_CC1NP_MASK                  TIM1_CCER_CC1NP_MASK
#define TIM_ADV_CCER_CC1NP(x)                    TIM1_CCER_CC1NP(x)

#define TIM_ADV_CCER_CC1NE_SHIFT                 TIM1_CCER_CC1NE_SHIFT
#define TIM_ADV_CCER_CC1NE_MASK                  TIM1_CCER_CC1NE_MASK
#define TIM_ADV_CCER_CC1NE(x)                    TIM1_CCER_CC1NE(x)

#define TIM_ADV_CCER_CC1P_SHIFT                  TIM1_CCER_CC1P_SHIFT
#define TIM_ADV_CCER_CC1P_MASK                   TIM1_CCER_CC1P_MASK
#define TIM_ADV_CCER_CC1P(x)                     TIM1_CCER_CC1P(x)

#define TIM_ADV_CCER_CC1E_SHIFT                  TIM1_CCER_CC1E_SHIFT
#define TIM_ADV_CCER_CC1E_MASK                   TIM1_CCER_CC1E_MASK
#define TIM_ADV_CCER_CC1E(x)                     TIM1_CCER_CC1E(x)

/*!
 * @brief TIM_ADV_CNT Register Bit Definition
 */

#define TIM_ADV_CNT_CNT_SHIFT                    TIM1_CNT_CNT_SHIFT
#define TIM_ADV_CNT_CNT_MASK                     TIM1_CNT_CNT_MASK
#define TIM_ADV_CNT_CNT(x)                       TIM1_CNT_CNT(x)

/*!
 * @brief TIM_ADV_PSC Register Bit Definition
 */

