AllenMaa/mm32f5330_canable/code/mm32f5330_canable_mdk/device/mm32f5333d_features.h
#define TIM_ADV_PSC_PSC_SHIFT                    TIM1_PSC_PSC_SHIFT
#define TIM_ADV_PSC_PSC_MASK                     TIM1_PSC_PSC_MASK
#define TIM_ADV_PSC_PSC(x)                       TIM1_PSC_PSC(x)

/*!
 * @brief TIM_ADV_ARR Register Bit Definition
 */

#define TIM_ADV_ARR_ARR_SHIFT                    TIM1_ARR_ARR_SHIFT
#define TIM_ADV_ARR_ARR_MASK                     TIM1_ARR_ARR_MASK
#define TIM_ADV_ARR_ARR(x)                       TIM1_ARR_ARR(x)

/*!
 * @brief TIM_ADV_RCR Register Bit Definition
 */

#define TIM_ADV_RCR_REPCNT_SHIFT                 TIM1_RCR_REPCNT_SHIFT
#define TIM_ADV_RCR_REPCNT_MASK                  TIM1_RCR_REPCNT_MASK
#define TIM_ADV_RCR_REPCNT(x)                    TIM1_RCR_REPCNT(x)

#define TIM_ADV_RCR_REP_SHIFT                    TIM1_RCR_REP_SHIFT
#define TIM_ADV_RCR_REP_MASK                     TIM1_RCR_REP_MASK
#define TIM_ADV_RCR_REP(x)                       TIM1_RCR_REP(x)

/*!
 * @brief TIM_ADV_CCR Register Bit Definition
 */

#define TIM_ADV_CCR_CCR_SHIFT                    TIM1_CCR_CCR_SHIFT
#define TIM_ADV_CCR_CCR_MASK                     TIM1_CCR_CCR_MASK
#define TIM_ADV_CCR_CCR(x)                       TIM1_CCR_CCR(x)

/*!
 * @brief TIM_ADV_BDTR Register Bit Definition
 */

#define TIM_ADV_BDTR_DOE_SHIFT                     (16)
#define TIM_ADV_BDTR_DOE_MASK                      (0x01U << TIM1_BDTR_DOE_SHIFT)
#define TIM_ADV_BDTR_DOE(x)                        (((uint32_t)(((uint32_t)(x)) << TIM1_BDTR_DOE_SHIFT)) & TIM1_BDTR_DOE_MASK)

#define TIM_ADV_BDTR_MOE_SHIFT                   TIM1_BDTR_MOE_SHIFT
#define TIM_ADV_BDTR_MOE_MASK                    TIM1_BDTR_MOE_MASK
#define TIM_ADV_BDTR_MOE(x)                      TIM1_BDTR_MOE(x)

#define TIM_ADV_BDTR_AOE_SHIFT                   TIM1_BDTR_AOE_SHIFT
#define TIM_ADV_BDTR_AOE_MASK                    TIM1_BDTR_AOE_MASK
#define TIM_ADV_BDTR_AOE(x)                      TIM1_BDTR_AOE(x)

#define TIM_ADV_BDTR_BKP_SHIFT                   TIM1_BDTR_BKP_SHIFT
#define TIM_ADV_BDTR_BKP_MASK                    TIM1_BDTR_BKP_MASK
#define TIM_ADV_BDTR_BKP(x)                      TIM1_BDTR_BKP(x)

#define TIM_ADV_BDTR_BKE_SHIFT                   TIM1_BDTR_BKE_SHIFT
#define TIM_ADV_BDTR_BKE_MASK                    TIM1_BDTR_BKE_MASK
#define TIM_ADV_BDTR_BKE(x)                      TIM1_BDTR_BKE(x)

#define TIM_ADV_BDTR_OSSR_SHIFT                  TIM1_BDTR_OSSR_SHIFT
#define TIM_ADV_BDTR_OSSR_MASK                   TIM1_BDTR_OSSR_MASK
#define TIM_ADV_BDTR_OSSR(x)                     TIM1_BDTR_OSSR(x)

#define TIM_ADV_BDTR_OSSI_SHIFT                  TIM1_BDTR_OSSI_SHIFT
#define TIM_ADV_BDTR_OSSI_MASK                   TIM1_BDTR_OSSI_MASK
#define TIM_ADV_BDTR_OSSI(x)                     TIM1_BDTR_OSSI(x)

#define TIM_ADV_BDTR_LOCK_SHIFT                  TIM1_BDTR_LOCK_SHIFT
#define TIM_ADV_BDTR_LOCK_MASK                   TIM1_BDTR_LOCK_MASK
#define TIM_ADV_BDTR_LOCK(x)                     TIM1_BDTR_LOCK(x)

#define TIM_ADV_BDTR_DTG_SHIFT                   TIM1_BDTR_DTG_SHIFT
#define TIM_ADV_BDTR_DTG_MASK                    TIM1_BDTR_DTG_MASK
#define TIM_ADV_BDTR_DTG(x)                      TIM1_BDTR_DTG(x)

/*!
 * @brief TIM_ADV_DCR Register Bit Definition
 */

#define TIM_ADV_DCR_DBL_SHIFT                    TIM1_DCR_DBL_SHIFT
#define TIM_ADV_DCR_DBL_MASK                     TIM1_DCR_DBL_MASK
#define TIM_ADV_DCR_DBL(x)                       TIM1_DCR_DBL(x)

#define TIM_ADV_DCR_DBA_SHIFT                    TIM1_DCR_DBA_SHIFT
#define TIM_ADV_DCR_DBA_MASK                     TIM1_DCR_DBA_MASK
#define TIM_ADV_DCR_DBA(x)                       TIM1_DCR_DBA(x)

/*!
 * @brief TIM_ADV_DMAR Register Bit Definition
 */

#define TIM_ADV_DMAR_DMAB_SHIFT                  TIM1_DMAR_DMAB_SHIFT
#define TIM_ADV_DMAR_DMAB_MASK                   TIM1_DMAR_DMAB_MASK
#define TIM_ADV_DMAR_DMAB(x)                     TIM1_DMAR_DMAB(x)

/*!
 * @brief TIM_ADV_CCMR3 Register Bit Definition
 */

#define TIM_ADV_CCMR3_OC5M_SHIFT                 TIM1_CCMR3_OC5M_SHIFT
#define TIM_ADV_CCMR3_OC5M_MASK                  TIM1_CCMR3_OC5M_MASK
#define TIM_ADV_CCMR3_OC5M(x)                    TIM1_CCMR3_OC5M(x)

#define TIM_ADV_CCMR3_OC5PE_SHIFT                TIM1_CCMR3_OC5PE_SHIFT
#define TIM_ADV_CCMR3_OC5PE_MASK                 TIM1_CCMR3_OC5PE_MASK
#define TIM_ADV_CCMR3_OC5PE(x)                   TIM1_CCMR3_OC5PE(x)

#define TIM_ADV_CCMR3_OC5FE_SHIFT                TIM1_CCMR3_OC5FE_SHIFT
#define TIM_ADV_CCMR3_OC5FE_MASK                 TIM1_CCMR3_OC5FE_MASK
#define TIM_ADV_CCMR3_OC5FE(x)                   TIM1_CCMR3_OC5FE(x)

/*!
 * @brief TIM_ADV_CCR5 Register Bit Definition
 */

#define TIM_ADV_CCR5_CCR5_SHIFT                  TIM1_CCR5_CCR5_SHIFT
#define TIM_ADV_CCR5_CCR5_MASK                   TIM1_CCR5_CCR5_MASK
#define TIM_ADV_CCR5_CCR5(x)                     TIM1_CCR5_CCR5(x)

/*!
 * @brief TIM_ADV_PDER Register Bit Definition
 */

#define TIM_ADV_PDER_CCR5SHIFTEN_SHIFT           TIM1_PDER_CCR5SHIFTEN_SHIFT
#define TIM_ADV_PDER_CCR5SHIFTEN_MASK            TIM1_PDER_CCR5SHIFTEN_MASK
#define TIM_ADV_PDER_CCR5SHIFTEN(x)              TIM1_PDER_CCR5SHIFTEN(x)

#define TIM_ADV_PDER_CCR4SHIFTEN_SHIFT           TIM1_PDER_CCR4SHIFTEN_SHIFT
#define TIM_ADV_PDER_CCR4SHIFTEN_MASK            TIM1_PDER_CCR4SHIFTEN_MASK
#define TIM_ADV_PDER_CCR4SHIFTEN(x)              TIM1_PDER_CCR4SHIFTEN(x)

#define TIM_ADV_PDER_CCR3SHIFTEN_SHIFT           TIM1_PDER_CCR3SHIFTEN_SHIFT
#define TIM_ADV_PDER_CCR3SHIFTEN_MASK            TIM1_PDER_CCR3SHIFTEN_MASK
#define TIM_ADV_PDER_CCR3SHIFTEN(x)              TIM1_PDER_CCR3SHIFTEN(x)

#define TIM_ADV_PDER_CCR2SHIFTEN_SHIFT           TIM1_PDER_CCR2SHIFTEN_SHIFT
#define TIM_ADV_PDER_CCR2SHIFTEN_MASK            TIM1_PDER_CCR2SHIFTEN_MASK
#define TIM_ADV_PDER_CCR2SHIFTEN(x)              TIM1_PDER_CCR2SHIFTEN(x)

#define TIM_ADV_PDER_CCR1SHIFTEN_SHIFT           TIM1_PDER_CCR1SHIFTEN_SHIFT
#define TIM_ADV_PDER_CCR1SHIFTEN_MASK            TIM1_PDER_CCR1SHIFTEN_MASK
#define TIM_ADV_PDER_CCR1SHIFTEN(x)              TIM1_PDER_CCR1SHIFTEN(x)

#define TIM_ADV_PDER_CCDREPE_SHIFT               TIM1_PDER_CCDREPE_SHIFT
#define TIM_ADV_PDER_CCDREPE_MASK                TIM1_PDER_CCDREPE_MASK
#define TIM_ADV_PDER_CCDREPE(x)                  TIM1_PDER_CCDREPE(x)

/*!
 * @brief TIM_ADV_CCRFALL Register Bit Definition
 */

#define TIM_ADV_CCRFALL_CCRFALL_SHIFT            TIM1_CCRFALL_CCRFALL_SHIFT
#define TIM_ADV_CCRFALL_CCRFALL_MASK             TIM1_CCRFALL_CCRFALL_MASK
#define TIM_ADV_CCRFALL_CCRFALL(x)               TIM1_CCRFALL_CCRFALL(x)

/*!
 * @brief TIM_ADV_BKINF Register Bit Definition
 */

#define TIM_ADV_BKINF_COMPBKINSEL_SHIFT           TIM1_BKINF_COMPBKINSEL_SHIFT
#define TIM_ADV_BKINF_COMPBKINSEL_MASK            TIM1_BKINF_COMPBKINSEL_MASK
#define TIM_ADV_BKINF_COMPBKINSEL(x)              TIM1_BKINF_COMPBKINSEL(x)

