AllenMaa/mm32f5330_canable/code/mm32f5330_canable_mdk/device/mm32f5333d_features.h
#define TIM_ADV_BKINF_IOBKINSEL_SHIFT            TIM1_BKINF_IOBKINSEL_SHIFT
#define TIM_ADV_BKINF_IOBKINSEL_MASK             TIM1_BKINF_IOBKINSEL_MASK
#define TIM_ADV_BKINF_IOBKINSEL(x)               TIM1_BKINF_IOBKINSEL(x)

#define TIM_ADV_BKINF_CSSBKINSEL_SHIFT           TIM1_BKINF_CSSBKINSEL_SHIFT
#define TIM_ADV_BKINF_CSSBKINSEL_MASK            TIM1_BKINF_CSSBKINSEL_MASK
#define TIM_ADV_BKINF_CSSBKINSEL(x)              TIM1_BKINF_CSSBKINSEL(x)

#define TIM_ADV_BKINF_BKINF_SHIFT                TIM1_BKINF_BKINF_SHIFT
#define TIM_ADV_BKINF_BKINF_MASK                 TIM1_BKINF_BKINF_MASK
#define TIM_ADV_BKINF_BKINF(x)                   TIM1_BKINF_BKINF(x)

#define TIM_ADV_BKINF_BKINFE_SHIFT               TIM1_BKINF_BKINFE_SHIFT
#define TIM_ADV_BKINF_BKINFE_MASK                TIM1_BKINF_BKINFE_MASK
#define TIM_ADV_BKINF_BKINFE(x)                  TIM1_BKINF_BKINFE(x)

/*!
 * @}
 */ /* end of group TIM_ADV_Register_Masks */

/*******************************************************************************
 * TIM2 Type
 ******************************************************************************/
/*!
 * @addtogroup TIM_32B_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief TIM_32B_CR1 Register Bit Definition
 */

#define TIM_32B_CR1_CKD_SHIFT                  TIM2_CR1_CKD_SHIFT
#define TIM_32B_CR1_CKD_MASK                   TIM2_CR1_CKD_MASK
#define TIM_32B_CR1_CKD(x)                     TIM2_CR1_CKD(x)

#define TIM_32B_CR1_ARPE_SHIFT                 TIM2_CR1_ARPE_SHIFT
#define TIM_32B_CR1_ARPE_MASK                  TIM2_CR1_ARPE_MASK
#define TIM_32B_CR1_ARPE(x)                    TIM2_CR1_ARPE(x)

#define TIM_32B_CR1_CMS_SHIFT                  TIM2_CR1_CMS_SHIFT
#define TIM_32B_CR1_CMS_MASK                   TIM2_CR1_CMS_MASK
#define TIM_32B_CR1_CMS(x)                     TIM2_CR1_CMS(x)

#define TIM_32B_CR1_DIR_SHIFT                  TIM2_CR1_DIR_SHIFT
#define TIM_32B_CR1_DIR_MASK                   TIM2_CR1_DIR_MASK
#define TIM_32B_CR1_DIR(x)                     TIM2_CR1_DIR(x)

#define TIM_32B_CR1_OPM_SHIFT                  TIM2_CR1_OPM_SHIFT
#define TIM_32B_CR1_OPM_MASK                   TIM2_CR1_OPM_MASK
#define TIM_32B_CR1_OPM(x)                     TIM2_CR1_OPM(x)

#define TIM_32B_CR1_URS_SHIFT                  TIM2_CR1_URS_SHIFT
#define TIM_32B_CR1_URS_MASK                   TIM2_CR1_URS_MASK
#define TIM_32B_CR1_URS(x)                     TIM2_CR1_URS(x)

#define TIM_32B_CR1_UDIS_SHIFT                 TIM2_CR1_UDIS_SHIFT
#define TIM_32B_CR1_UDIS_MASK                  TIM2_CR1_UDIS_MASK
#define TIM_32B_CR1_UDIS(x)                    TIM2_CR1_UDIS(x)

#define TIM_32B_CR1_CEN_SHIFT                  TIM2_CR1_CEN_SHIFT
#define TIM_32B_CR1_CEN_MASK                   TIM2_CR1_CEN_MASK
#define TIM_32B_CR1_CEN(x)                     TIM2_CR1_CEN(x)

/*!
 * @brief TIM_32B_CR2 Register Bit Definition
 */

#define TIM_32B_CR2_TI1S_SHIFT                 TIM2_CR2_TI1S_SHIFT
#define TIM_32B_CR2_TI1S_MASK                  TIM2_CR2_TI1S_MASK
#define TIM_32B_CR2_TI1S(x)                    TIM2_CR2_TI1S(x)

#define TIM_32B_CR2_MMS_SHIFT                  TIM2_CR2_MMS_SHIFT
#define TIM_32B_CR2_MMS_MASK                   TIM2_CR2_MMS_MASK
#define TIM_32B_CR2_MMS(x)                     TIM2_CR2_MMS(x)

#define TIM_32B_CR2_CCDS_SHIFT                 TIM2_CR2_CCDS_SHIFT
#define TIM_32B_CR2_CCDS_MASK                  TIM2_CR2_CCDS_MASK
#define TIM_32B_CR2_CCDS(x)                    TIM2_CR2_CCDS(x)

/*!
 * @brief TIM_32B_SMCR Register Bit Definition
 */

#define TIM_32B_SMCR_ETP_SHIFT                 TIM2_SMCR_ETP_SHIFT
#define TIM_32B_SMCR_ETP_MASK                  TIM2_SMCR_ETP_MASK
#define TIM_32B_SMCR_ETP(x)                    TIM2_SMCR_ETP(x)

#define TIM_32B_SMCR_ECE_SHIFT                 TIM2_SMCR_ECE_SHIFT
#define TIM_32B_SMCR_ECE_MASK                  TIM2_SMCR_ECE_MASK
#define TIM_32B_SMCR_ECE(x)                    TIM2_SMCR_ECE(x)

#define TIM_32B_SMCR_ETPS_SHIFT                TIM2_SMCR_ETPS_SHIFT
#define TIM_32B_SMCR_ETPS_MASK                 TIM2_SMCR_ETPS_MASK
#define TIM_32B_SMCR_ETPS(x)                   TIM2_SMCR_ETPS(x)

#define TIM_32B_SMCR_ETF_SHIFT                 TIM2_SMCR_ETF_SHIFT
#define TIM_32B_SMCR_ETF_MASK                  TIM2_SMCR_ETF_MASK
#define TIM_32B_SMCR_ETF(x)                    TIM2_SMCR_ETF(x)

#define TIM_32B_SMCR_MSM_SHIFT                 TIM2_SMCR_MSM_SHIFT
#define TIM_32B_SMCR_MSM_MASK                  TIM2_SMCR_MSM_MASK
#define TIM_32B_SMCR_MSM(x)                    TIM2_SMCR_MSM(x)

#define TIM_32B_SMCR_TS_SHIFT                  TIM2_SMCR_TS_SHIFT
#define TIM_32B_SMCR_TS_MASK                   TIM2_SMCR_TS_MASK
#define TIM_32B_SMCR_TS(x)                     TIM2_SMCR_TS(x)

#define TIM_32B_SMCR_OCCS_SHIFT                TIM2_SMCR_OCCS_SHIFT
#define TIM_32B_SMCR_OCCS_MASK                 TIM2_SMCR_OCCS_MASK
#define TIM_32B_SMCR_OCCS(x)                   TIM2_SMCR_OCCS(x)

#define TIM_32B_SMCR_SMS_SHIFT                 TIM2_SMCR_SMS_SHIFT
#define TIM_32B_SMCR_SMS_MASK                  TIM2_SMCR_SMS_MASK
#define TIM_32B_SMCR_SMS(x)                    TIM2_SMCR_SMS(x)

/*!
 * @brief TIM_32B_DIER Register Bit Definition
 */

#define TIM_32B_DIER_TDE_SHIFT                 TIM2_DIER_TDE_SHIFT
#define TIM_32B_DIER_TDE_MASK                  TIM2_DIER_TDE_MASK
#define TIM_32B_DIER_TDE(x)                    TIM2_DIER_TDE(x)

#define TIM_32B_DIER_CC4DE_SHIFT               TIM2_DIER_CC4DE_SHIFT
#define TIM_32B_DIER_CC4DE_MASK                TIM2_DIER_CC4DE_MASK
#define TIM_32B_DIER_CC4DE(x)                  TIM2_DIER_CC4DE(x)

#define TIM_32B_DIER_CC3DE_SHIFT               TIM2_DIER_CC3DE_SHIFT
#define TIM_32B_DIER_CC3DE_MASK                TIM2_DIER_CC3DE_MASK
#define TIM_32B_DIER_CC3DE(x)                  TIM2_DIER_CC3DE(x)

#define TIM_32B_DIER_CC2DE_SHIFT               TIM2_DIER_CC2DE_SHIFT
#define TIM_32B_DIER_CC2DE_MASK                TIM2_DIER_CC2DE_MASK
#define TIM_32B_DIER_CC2DE(x)                  TIM2_DIER_CC2DE(x)

#define TIM_32B_DIER_CC1DE_SHIFT               TIM2_DIER_CC1DE_SHIFT
#define TIM_32B_DIER_CC1DE_MASK                TIM2_DIER_CC1DE_MASK
#define TIM_32B_DIER_CC1DE(x)                  TIM2_DIER_CC1DE(x)

#define TIM_32B_DIER_UDE_SHIFT                 TIM2_DIER_UDE_SHIFT
#define TIM_32B_DIER_UDE_MASK                  TIM2_DIER_UDE_MASK
#define TIM_32B_DIER_UDE(x)                    TIM2_DIER_UDE(x)

