AllenMaa/mm32f5330_canable/code/mm32f5330_canable_mdk/device/mm32f5333d_features.h
#define TIM_32B_ARR_ARR_SHIFT                  TIM2_ARR_ARR_SHIFT
#define TIM_32B_ARR_ARR_MASK                   TIM2_ARR_ARR_MASK
#define TIM_32B_ARR_ARR(x)                     TIM2_ARR_ARR(x)

/*!
 * @brief TIM_32B_CCR Register Bit Definition
 */

#define TIM_32B_CCR_CCR_SHIFT                  TIM2_CCR_CCR_SHIFT
#define TIM_32B_CCR_CCR_MASK                   TIM2_CCR_CCR_MASK
#define TIM_32B_CCR_CCR(x)                     TIM2_CCR_CCR(x)

/*!
 * @brief TIM_32B_DCR Register Bit Definition
 */

#define TIM_32B_DCR_DBL_SHIFT                  TIM2_DCR_DBL_SHIFT
#define TIM_32B_DCR_DBL_MASK                   TIM2_DCR_DBL_MASK
#define TIM_32B_DCR_DBL(x)                     TIM2_DCR_DBL(x)

#define TIM_32B_DCR_DBA_SHIFT                  TIM2_DCR_DBA_SHIFT
#define TIM_32B_DCR_DBA_MASK                   TIM2_DCR_DBA_MASK
#define TIM_32B_DCR_DBA(x)                     TIM2_DCR_DBA(x)

/*!
 * @brief TIM_32B_DMAR Register Bit Definition
 */

#define TIM_32B_DMAR_DMAB_SHIFT                TIM2_DMAR_DMAB_SHIFT
#define TIM_32B_DMAR_DMAB_MASK                 TIM2_DMAR_DMAB_MASK
#define TIM_32B_DMAR_DMAB(x)                   TIM2_DMAR_DMAB(x)

/*!
 * @brief TIM_32B_OR Register Bit Definition
 */

#define TIM_32B_OR_TI4RMP_SHIFT                TIM2_OR_TI4RMP_SHIFT
#define TIM_32B_OR_TI4RMP_MASK                 TIM2_OR_TI4RMP_MASK
#define TIM_32B_OR_TI4RMP(x)                   TIM2_OR_TI4RMP(x)

#define TIM_32B_OR_ETRRMP_SHIFT                TIM2_OR_ETRRMP_SHIFT
#define TIM_32B_OR_ETRRMP_MASK                 TIM2_OR_ETRRMP_MASK
#define TIM_32B_OR_ETRRMP(x)                   TIM2_OR_ETRRMP(x)

/*!
 * @}
 */ /* end of group TIM_32B_Register_Masks */

/*******************************************************************************
 * TIM_BASIC Type
 ******************************************************************************/

/*!
 * @addtogroup TIM_BASIC_Register_Masks Register Masks
 * @{
 */
/*!
 * @brief TIM_BASIC_CR1 Register Bit Definition
 */

#define TIM_BASIC_CR1_ARPE_SHIFT                 TIM6_CR1_ARPE_SHIFT
#define TIM_BASIC_CR1_ARPE_MASK                  TIM6_CR1_ARPE_MASK
#define TIM_BASIC_CR1_ARPE(x)                    TIM6_CR1_ARPE(x)

#define TIM_BASIC_CR1_OPM_SHIFT                  TIM6_CR1_OPM_SHIFT
#define TIM_BASIC_CR1_OPM_MASK                   TIM6_CR1_OPM_MASK
#define TIM_BASIC_CR1_OPM(x)                     TIM6_CR1_OPM(x)

#define TIM_BASIC_CR1_URS_SHIFT                  TIM6_CR1_URS_SHIFT
#define TIM_BASIC_CR1_URS_MASK                   TIM6_CR1_URS_MASK
#define TIM_BASIC_CR1_URS(x)                     TIM6_CR1_URS(x)

#define TIM_BASIC_CR1_UDIS_SHIFT                 TIM6_CR1_UDIS_SHIFT
#define TIM_BASIC_CR1_UDIS_MASK                  TIM6_CR1_UDIS_MASK
#define TIM_BASIC_CR1_UDIS(x)                    TIM6_CR1_UDIS(x)

#define TIM_BASIC_CR1_CEN_SHIFT                  TIM6_CR1_CEN_SHIFT
#define TIM_BASIC_CR1_CEN_MASK                   TIM6_CR1_CEN_MASK
#define TIM_BASIC_CR1_CEN(x)                     TIM6_CR1_CEN(x)

/*!
 * @brief TIM_BASIC_DIER Register Bit Definition
 */

#define TIM_BASIC_DIER_UDE_SHIFT                 TIM6_DIER_UDE_SHIFT
#define TIM_BASIC_DIER_UDE_MASK                  TIM6_DIER_UDE_MASK
#define TIM_BASIC_DIER_UDE(x)                    TIM6_DIER_UDE(x)

#define TIM_BASIC_DIER_UIE_SHIFT                 TIM6_DIER_UIE_SHIFT
#define TIM_BASIC_DIER_UIE_MASK                  TIM6_DIER_UIE_MASK
#define TIM_BASIC_DIER_UIE(x)                    TIM6_DIER_UIE(x)

/*!
 * @brief TIM_BASIC_SR Register Bit Definition
 */

#define TIM_BASIC_SR_UIF_SHIFT                   TIM6_SR_UIF_SHIFT
#define TIM_BASIC_SR_UIF_MASK                    TIM6_SR_UIF_MASK
#define TIM_BASIC_SR_UIF(x)                      TIM6_SR_UIF(x)

/*!
 * @brief TIM_BASIC_EGR Register Bit Definition
 */

#define TIM_BASIC_EGR_UG_SHIFT                   TIM6_EGR_UG_SHIFT
#define TIM_BASIC_EGR_UG_MASK                    TIM6_EGR_UG_MASK
#define TIM_BASIC_EGR_UG(x)                      TIM6_EGR_UG(x)

/*!
 * @brief TIM_BASIC_CNT Register Bit Definition
 */

#define TIM_BASIC_CNT_CNT_SHIFT                  TIM6_CNT_CNT_SHIFT
#define TIM_BASIC_CNT_CNT_MASK                   TIM6_CNT_CNT_MASK
#define TIM_BASIC_CNT_CNT(x)                     TIM6_CNT_CNT(x)

/*!
 * @brief TIM_BASIC_PSC Register Bit Definition
 */

#define TIM_BASIC_PSC_PSC_SHIFT                  TIM6_PSC_PSC_SHIFT
#define TIM_BASIC_PSC_PSC_MASK                   TIM6_PSC_PSC_MASK
#define TIM_BASIC_PSC_PSC(x)                     TIM6_PSC_PSC(x)

/*!
 * @brief TIM_BASIC_ARR Register Bit Definition
 */

#define TIM_BASIC_ARR_ARR_SHIFT                  TIM6_ARR_ARR_SHIFT
#define TIM_BASIC_ARR_ARR_MASK                   TIM6_ARR_ARR_MASK
#define TIM_BASIC_ARR_ARR(x)                     TIM6_ARR_ARR(x)


/*!
 * @addtogroup TIM_Peripheral_Access_Layer TIM Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * TIM Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t CR1;                                                            ///< Control Register 1                           offset: 0x00
    __IO uint32_t CR2;                                                            ///< Control Register 2                           offset: 0x04
    __IO uint32_t SMCR;                                                           ///< Slave Mode Control Register                  offset: 0x08
    __IO uint32_t DIER;                                                           ///< DMA/Interrupt Enable Register                offset: 0x0C
    __IO uint32_t SR;                                                             ///< status register                              offset: 0x10
    __IO uint32_t EGR;                                                            ///< event generation register                    offset: 0x14
    __IO uint32_t CCMR1;                                                          ///< Capture/Compare Mode Register 1              offset: 0x18
    __IO uint32_t CCMR2;                                                          ///< Capture/Compare Mode Register 2              offset: 0x1C
    __IO uint32_t CCER;                                                           ///< Capture/Compare Enable Register              offset: 0x20
    __IO uint32_t CNT;                                                            ///< counter                                      offset: 0x24
    __IO uint32_t PSC;                                                            ///< Prescaler                                    offset: 0x28
    __IO uint32_t ARR;                                                            ///< autoload register                            offset: 0x2C
    __IO uint32_t RCR;                                                            ///< Repeat count register                        offset: 0x30
    __IO uint32_t CCR[4];                                                            ///< Capture/Compare Register 1                   offset: 0x34
    __IO uint32_t BDTR;                                                           ///< Brake and Deadband Registers                 offset: 0x44
    __IO uint32_t DCR;                                                            ///< DMA Control Register                         offset: 0x48
    __IO uint32_t DMAR;                                                           ///< DMA address for continuous mode              offset: 0x4C
    __IO uint32_t Reserved0[1];                                                   ///< Reserved
    __IO uint32_t CCMR3;                                                          ///< Capture/Compare Mode Register 3              offset: 0x54
    __IO uint32_t CCR5;                                                           ///< Capture/Compare Register 5                   offset: 0x58
    __IO uint32_t PDER;                                                           ///< PWM phase shift/DMA repeat update request enable registeroffset: 0x5C
    __IO uint32_t CCRFALL[5];                                                       ///< PWM Phase Shift Down Count Capture/Compare Registeroffset: 0x60
    __IO uint32_t BKINF;                                                          ///< brake input filter register                  offset: 0x74
} TIM_Type;

