AllenMaa/mm32f5330_canable/code/mm32f5330_canable_mdk/device/mm32f5333d_features.h
/*******************************************************************************
 * TIM Type
 ******************************************************************************/

/*!
 * @addtogroup TIM_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief TIM_CR1 Register Bit Definition
 */

#define TIM_CR1_CKD_SHIFT                      (8)
#define TIM_CR1_CKD_MASK                       (0x3U << TIM_CR1_CKD_SHIFT)
#define TIM_CR1_CKD(x)                         (((uint32_t)(((uint32_t)(x)) << TIM_CR1_CKD_SHIFT)) & TIM_CR1_CKD_MASK)

#define TIM_CR1_ARPE_SHIFT                     (7)
#define TIM_CR1_ARPE_MASK                      (0x01U << TIM_CR1_ARPE_SHIFT)
#define TIM_CR1_ARPE(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_CR1_ARPE_SHIFT)) & TIM_CR1_ARPE_MASK)

#define TIM_CR1_CMS_SHIFT                      (5)
#define TIM_CR1_CMS_MASK                       (0x3U << TIM_CR1_CMS_SHIFT)
#define TIM_CR1_CMS(x)                         (((uint32_t)(((uint32_t)(x)) << TIM_CR1_CMS_SHIFT)) & TIM_CR1_CMS_MASK)

#define TIM_CR1_DIR_SHIFT                      (4)
#define TIM_CR1_DIR_MASK                       (0x01U << TIM_CR1_DIR_SHIFT)
#define TIM_CR1_DIR(x)                         (((uint32_t)(((uint32_t)(x)) << TIM_CR1_DIR_SHIFT)) & TIM_CR1_DIR_MASK)

#define TIM_CR1_OPM_SHIFT                      (3)
#define TIM_CR1_OPM_MASK                       (0x01U << TIM_CR1_OPM_SHIFT)
#define TIM_CR1_OPM(x)                         (((uint32_t)(((uint32_t)(x)) << TIM_CR1_OPM_SHIFT)) & TIM_CR1_OPM_MASK)

#define TIM_CR1_URS_SHIFT                      (2)
#define TIM_CR1_URS_MASK                       (0x01U << TIM_CR1_URS_SHIFT)
#define TIM_CR1_URS(x)                         (((uint32_t)(((uint32_t)(x)) << TIM_CR1_URS_SHIFT)) & TIM_CR1_URS_MASK)

#define TIM_CR1_UDIS_SHIFT                     (1)
#define TIM_CR1_UDIS_MASK                      (0x01U << TIM_CR1_UDIS_SHIFT)
#define TIM_CR1_UDIS(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_CR1_UDIS_SHIFT)) & TIM_CR1_UDIS_MASK)

#define TIM_CR1_CEN_SHIFT                      (0)
#define TIM_CR1_CEN_MASK                       (0x01U << TIM_CR1_CEN_SHIFT)
#define TIM_CR1_CEN(x)                         (((uint32_t)(((uint32_t)(x)) << TIM_CR1_CEN_SHIFT)) & TIM_CR1_CEN_MASK)

/*!
 * @brief TIM_CR2 Register Bit Definition
 */

#define TIM_CR2_OIS4N_SHIFT                    (15)
#define TIM_CR2_OIS4N_MASK                     (0x01U << TIM_CR2_OIS4N_SHIFT)
#define TIM_CR2_OIS4N(x)                       (((uint32_t)(((uint32_t)(x)) << TIM_CR2_OIS4N_SHIFT)) & TIM_CR2_OIS4N_MASK)

#define TIM_CR2_OIS4_SHIFT                     (14)
#define TIM_CR2_OIS4_MASK                      (0x01U << TIM_CR2_OIS4_SHIFT)
#define TIM_CR2_OIS4(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_CR2_OIS4_SHIFT)) & TIM_CR2_OIS4_MASK)

#define TIM_CR2_OIS3N_SHIFT                    (13)
#define TIM_CR2_OIS3N_MASK                     (0x01U << TIM_CR2_OIS3N_SHIFT)
#define TIM_CR2_OIS3N(x)                       (((uint32_t)(((uint32_t)(x)) << TIM_CR2_OIS3N_SHIFT)) & TIM_CR2_OIS3N_MASK)

#define TIM_CR2_OIS3_SHIFT                     (12)
#define TIM_CR2_OIS3_MASK                      (0x01U << TIM_CR2_OIS3_SHIFT)
#define TIM_CR2_OIS3(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_CR2_OIS3_SHIFT)) & TIM_CR2_OIS3_MASK)

#define TIM_CR2_OIS2N_SHIFT                    (11)
#define TIM_CR2_OIS2N_MASK                     (0x01U << TIM_CR2_OIS2N_SHIFT)
#define TIM_CR2_OIS2N(x)                       (((uint32_t)(((uint32_t)(x)) << TIM_CR2_OIS2N_SHIFT)) & TIM_CR2_OIS2N_MASK)

#define TIM_CR2_OIS2_SHIFT                     (10)
#define TIM_CR2_OIS2_MASK                      (0x01U << TIM_CR2_OIS2_SHIFT)
#define TIM_CR2_OIS2(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_CR2_OIS2_SHIFT)) & TIM_CR2_OIS2_MASK)

#define TIM_CR2_OIS1N_SHIFT                    (9)
#define TIM_CR2_OIS1N_MASK                     (0x01U << TIM_CR2_OIS1N_SHIFT)
#define TIM_CR2_OIS1N(x)                       (((uint32_t)(((uint32_t)(x)) << TIM_CR2_OIS1N_SHIFT)) & TIM_CR2_OIS1N_MASK)

#define TIM_CR2_OIS1_SHIFT                     (8)
#define TIM_CR2_OIS1_MASK                      (0x01U << TIM_CR2_OIS1_SHIFT)
#define TIM_CR2_OIS1(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_CR2_OIS1_SHIFT)) & TIM_CR2_OIS1_MASK)

#define TIM_CR2_TI1S_SHIFT                     (7)
#define TIM_CR2_TI1S_MASK                      (0x01U << TIM_CR2_TI1S_SHIFT)
#define TIM_CR2_TI1S(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_CR2_TI1S_SHIFT)) & TIM_CR2_TI1S_MASK)

#define TIM_CR2_MMS_SHIFT                      (4)
#define TIM_CR2_MMS_MASK                       (0x7U << TIM_CR2_MMS_SHIFT)
#define TIM_CR2_MMS(x)                         (((uint32_t)(((uint32_t)(x)) << TIM_CR2_MMS_SHIFT)) & TIM_CR2_MMS_MASK)

#define TIM_CR2_CCDS_SHIFT                     (3)
#define TIM_CR2_CCDS_MASK                      (0x01U << TIM_CR2_CCDS_SHIFT)
#define TIM_CR2_CCDS(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_CR2_CCDS_SHIFT)) & TIM_CR2_CCDS_MASK)

#define TIM_CR2_CCUS_SHIFT                     (2)
#define TIM_CR2_CCUS_MASK                      (0x01U << TIM_CR2_CCUS_SHIFT)
#define TIM_CR2_CCUS(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_CR2_CCUS_SHIFT)) & TIM_CR2_CCUS_MASK)

#define TIM_CR2_CCPC_SHIFT                     (0)
#define TIM_CR2_CCPC_MASK                      (0x01U << TIM_CR2_CCPC_SHIFT)
#define TIM_CR2_CCPC(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_CR2_CCPC_SHIFT)) & TIM_CR2_CCPC_MASK)

/*!
 * @brief TIM_SMCR Register Bit Definition
 */

#define TIM_SMCR_ETP_SHIFT                     (15)
#define TIM_SMCR_ETP_MASK                      (0x01U << TIM_SMCR_ETP_SHIFT)
#define TIM_SMCR_ETP(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_SMCR_ETP_SHIFT)) & TIM_SMCR_ETP_MASK)

#define TIM_SMCR_ECE_SHIFT                     (14)
#define TIM_SMCR_ECE_MASK                      (0x01U << TIM_SMCR_ECE_SHIFT)
#define TIM_SMCR_ECE(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_SMCR_ECE_SHIFT)) & TIM_SMCR_ECE_MASK)

#define TIM_SMCR_ETPS_SHIFT                    (12)
#define TIM_SMCR_ETPS_MASK                     (0x3U << TIM_SMCR_ETPS_SHIFT)
#define TIM_SMCR_ETPS(x)                       (((uint32_t)(((uint32_t)(x)) << TIM_SMCR_ETPS_SHIFT)) & TIM_SMCR_ETPS_MASK)

#define TIM_SMCR_ETF_SHIFT                     (8)
#define TIM_SMCR_ETF_MASK                      (0xFU << TIM_SMCR_ETF_SHIFT)
#define TIM_SMCR_ETF(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_SMCR_ETF_SHIFT)) & TIM_SMCR_ETF_MASK)

#define TIM_SMCR_MSM_SHIFT                     (7)
#define TIM_SMCR_MSM_MASK                      (0x01U << TIM_SMCR_MSM_SHIFT)
#define TIM_SMCR_MSM(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_SMCR_MSM_SHIFT)) & TIM_SMCR_MSM_MASK)

#define TIM_SMCR_TS_SHIFT                      (4)
#define TIM_SMCR_TS_MASK                       (0x7U << TIM_SMCR_TS_SHIFT)
#define TIM_SMCR_TS(x)                         (((uint32_t)(((uint32_t)(x)) << TIM_SMCR_TS_SHIFT)) & TIM_SMCR_TS_MASK)

#define TIM_SMCR_OCCS_SHIFT                    (3)
#define TIM_SMCR_OCCS_MASK                     (0x01U << TIM_SMCR_OCCS_SHIFT)
#define TIM_SMCR_OCCS(x)                       (((uint32_t)(((uint32_t)(x)) << TIM_SMCR_OCCS_SHIFT)) & TIM_SMCR_OCCS_MASK)

