AllenMaa/mm32f5330_canable/code/mm32f5330_canable_mdk/device/mm32f5333d_features.h
#define TIM_PDER_CCR5SHIFTEN_SHIFT             (5)
#define TIM_PDER_CCR5SHIFTEN_MASK              (0x01U << TIM_PDER_CCR5SHIFTEN_SHIFT)
#define TIM_PDER_CCR5SHIFTEN(x)                (((uint32_t)(((uint32_t)(x)) << TIM_PDER_CCR5SHIFTEN_SHIFT)) & TIM_PDER_CCR5SHIFTEN_MASK)

#define TIM_PDER_CCR4SHIFTEN_SHIFT             (4)
#define TIM_PDER_CCR4SHIFTEN_MASK              (0x01U << TIM_PDER_CCR4SHIFTEN_SHIFT)
#define TIM_PDER_CCR4SHIFTEN(x)                (((uint32_t)(((uint32_t)(x)) << TIM_PDER_CCR4SHIFTEN_SHIFT)) & TIM_PDER_CCR4SHIFTEN_MASK)

#define TIM_PDER_CCR3SHIFTEN_SHIFT             (3)
#define TIM_PDER_CCR3SHIFTEN_MASK              (0x01U << TIM_PDER_CCR3SHIFTEN_SHIFT)
#define TIM_PDER_CCR3SHIFTEN(x)                (((uint32_t)(((uint32_t)(x)) << TIM_PDER_CCR3SHIFTEN_SHIFT)) & TIM_PDER_CCR3SHIFTEN_MASK)

#define TIM_PDER_CCR2SHIFTEN_SHIFT             (2)
#define TIM_PDER_CCR2SHIFTEN_MASK              (0x01U << TIM_PDER_CCR2SHIFTEN_SHIFT)
#define TIM_PDER_CCR2SHIFTEN(x)                (((uint32_t)(((uint32_t)(x)) << TIM_PDER_CCR2SHIFTEN_SHIFT)) & TIM_PDER_CCR2SHIFTEN_MASK)

#define TIM_PDER_CCR1SHIFTEN_SHIFT             (1)
#define TIM_PDER_CCR1SHIFTEN_MASK              (0x01U << TIM_PDER_CCR1SHIFTEN_SHIFT)
#define TIM_PDER_CCR1SHIFTEN(x)                (((uint32_t)(((uint32_t)(x)) << TIM_PDER_CCR1SHIFTEN_SHIFT)) & TIM_PDER_CCR1SHIFTEN_MASK)

#define TIM_PDER_CCDREPE_SHIFT                 (0)
#define TIM_PDER_CCDREPE_MASK                  (0x01U << TIM_PDER_CCDREPE_SHIFT)
#define TIM_PDER_CCDREPE(x)                    (((uint32_t)(((uint32_t)(x)) << TIM_PDER_CCDREPE_SHIFT)) & TIM_PDER_CCDREPE_MASK)

/*!
 * @brief TIM_CCRFALL Register Bit Definition
 */

#define TIM_CCRFALL_CCRFALL_SHIFT              (0)
#define TIM_CCRFALL_CCRFALL_MASK               (0xFFFFU << TIM_CCRFALL_CCRFALL_SHIFT)
#define TIM_CCRFALL_CCRFALL(x)                 (((uint32_t)(((uint32_t)(x)) << TIM_CCRFALL_CCRFALL_SHIFT)) & TIM_CCRFALL_CCRFALL_MASK)

/*!
 * @brief TIM_BKINF Register Bit Definition
 */

#define TIM_BKINF_COMPBKINSEL_SHIFT             (13)
#define TIM_BKINF_COMPBKINSEL_MASK              (0x7U << TIM_BKINF_COMPBKINSEL_SHIFT)
#define TIM_BKINF_COMPBKINSEL(x)                (((uint32_t)(((uint32_t)(x)) << TIM_BKINF_COMPBKINSEL_SHIFT)) & TIM_BKINF_COMPBKINSEL_MASK)

#define TIM_BKINF_IOBKINSEL_SHIFT              (6)
#define TIM_BKINF_IOBKINSEL_MASK               (0xFU << TIM_BKINF_IOBKINSEL_SHIFT)
#define TIM_BKINF_IOBKINSEL(x)                 (((uint32_t)(((uint32_t)(x)) << TIM_BKINF_IOBKINSEL_SHIFT)) & TIM_BKINF_IOBKINSEL_MASK)

#define TIM_BKINF_CSSBKINSEL_SHIFT             (5)
#define TIM_BKINF_CSSBKINSEL_MASK              (0x01U << TIM_BKINF_CSSBKINSEL_SHIFT)
#define TIM_BKINF_CSSBKINSEL(x)                (((uint32_t)(((uint32_t)(x)) << TIM_BKINF_CSSBKINSEL_SHIFT)) & TIM_BKINF_CSSBKINSEL_MASK)

#define TIM_BKINF_BKINF_SHIFT                  (1)
#define TIM_BKINF_BKINF_MASK                   (0xFU << TIM_BKINF_BKINF_SHIFT)
#define TIM_BKINF_BKINF(x)                     (((uint32_t)(((uint32_t)(x)) << TIM_BKINF_BKINF_SHIFT)) & TIM_BKINF_BKINF_MASK)

#define TIM_BKINF_BKINFE_SHIFT                 (0)
#define TIM_BKINF_BKINFE_MASK                  (0x01U << TIM_BKINF_BKINFE_SHIFT)
#define TIM_BKINF_BKINFE(x)                    (((uint32_t)(((uint32_t)(x)) << TIM_BKINF_BKINFE_SHIFT)) & TIM_BKINF_BKINFE_MASK)

/*!
 * @}
 */ /* end of group TIM_Register_Masks */

/* USB */
/*!
 * @brief USB_FS_OTGCTRL Register Bit Definition
 */

#define USB_FSOTGCTRL_DPHIGH_SHIFT              (7)
#define USB_FSOTGCTRL_DPHIGH_MASK               (0x01U << USB_FSOTGCTRL_DPHIGH_SHIFT)
#define USB_FSOTGCTRL_DPHIGH(x)                 (((uint32_t)(((uint32_t)(x)) << USB_FSOTGCTRL_DPHIGH_SHIFT)) & USB_FSOTGCTRL_DPHIGH_MASK)

#define USB_FSOTGCTRL_DMHIGH_SHIFT              (6)
#define USB_FSOTGCTRL_DMHIGH_MASK               (0x01U << USB_FSOTGCTRL_DMHIGH_SHIFT)
#define USB_FSOTGCTRL_DMHIGH(x)                 (((uint32_t)(((uint32_t)(x)) << USB_FSOTGCTRL_DMHIGH_SHIFT)) & USB_FSOTGCTRL_DMHIGH_MASK)

#define USB_FSOTGCTRL_DPLOW_SHIFT               (5)
#define USB_FSOTGCTRL_DPLOW_MASK                (0x01U << USB_FSOTGCTRL_DPLOW_SHIFT)
#define USB_FSOTGCTRL_DPLOW(x)                  (((uint32_t)(((uint32_t)(x)) << USB_FSOTGCTRL_DPLOW_SHIFT)) & USB_FSOTGCTRL_DPLOW_MASK)

#define USB_FSOTGCTRL_DMLOW_SHIFT               (4)
#define USB_FSOTGCTRL_DMLOW_MASK                (0x01U << USB_FSOTGCTRL_DMLOW_SHIFT)
#define USB_FSOTGCTRL_DMLOW(x)                  (((uint32_t)(((uint32_t)(x)) << USB_FSOTGCTRL_DMLOW_SHIFT)) & USB_FSOTGCTRL_DMLOW_MASK)

#define USB_FSOTGCTRL_OTGEN_SHIFT               (2)
#define USB_FSOTGCTRL_OTGEN_MASK                (0x01U << USB_FSOTGCTRL_OTGEN_SHIFT)
#define USB_FSOTGCTRL_OTGEN(x)                  (((uint32_t)(((uint32_t)(x)) << USB_FSOTGCTRL_OTGEN_SHIFT)) & USB_FSOTGCTRL_OTGEN_MASK)

#define USB_FSOTGCTRL_VBUSCHG_SHIFT             (1)
#define USB_FSOTGCTRL_VBUSCHG_MASK              (0x01U << USB_FSOTGCTRL_VBUSCHG_SHIFT)
#define USB_FSOTGCTRL_VBUSCHG(x)                (((uint32_t)(((uint32_t)(x)) << USB_FSOTGCTRL_VBUSCHG_SHIFT)) & USB_FSOTGCTRL_VBUSCHG_MASK)

#define USB_FSOTGCTRL_VBUSDSCHG_SHIFT           (0)
#define USB_FSOTGCTRL_VBUSDSCHG_MASK            (0x01U << USB_FSOTGCTRL_VBUSDSCHG_SHIFT)
#define USB_FSOTGCTRL_VBUSDSCHG(x)              (((uint32_t)(((uint32_t)(x)) << USB_FSOTGCTRL_VBUSDSCHG_SHIFT)) & USB_FSOTGCTRL_VBUSDSCHG_MASK)

/*!
 * @}
 */ /* end of group TIM_Peripheral_Access_Layer */



 #endif /* __MM32F5333d_FEATURES_H__ */
